### Terraform Plan Output

<details>
<summary>Click to expand plan</summary>

```terraform
aws_organizations_policy.region_restriction: Refreshing state... [id=p-bqqwq31q]
data.aws_organizations_organization.org: Reading...
aws_organizations_policy.dev_scp: Refreshing state... [id=p-p6r3khql]
aws_organizations_policy.protect_sso: Refreshing state... [id=p-c6pkxmge]
aws_organizations_policy.dev_tagging: Refreshing state... [id=p-uoovoddo]
aws_organizations_policy_attachment.dev_tagging_attachment: Refreshing state... [id=ou-srmc-f52jl8so:p-uoovoddo]
aws_organizations_policy_attachment.dev_scp_attachment: Refreshing state... [id=ou-srmc-f52jl8so:p-p6r3khql]
data.aws_organizations_organization.org: Read complete after 1s [id=o-3ffm2cc86k]
aws_organizations_policy_attachment.region_restriction_root: Refreshing state... [id=r-srmc:p-bqqwq31q]
aws_organizations_policy_attachment.protect_sso_root: Refreshing state... [id=r-srmc:p-c6pkxmge]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_organizations_policy.region_restriction will be updated in-place
  ~ resource "aws_organizations_policy" "region_restriction" {
      ~ content     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ NotAction = [
                            # (2 unchanged elements hidden)
                            "aws-portal:*",
                          + "bedrock:InvokeModel",
                          + "bedrock:InvokeModelWithResponseStream",
                          + "bedrock:ListInferenceProfiles",
                            "billing:*",
                            # (22 unchanged elements hidden)
                        ]
                        # (4 unchanged attributes hidden)
                    },
                  + {
                      + Action    = [
                          + "bedrock:InvokeModel",
                          + "bedrock:InvokeModelWithResponseStream",
                          + "bedrock:ListInferenceProfiles",
                        ]
                      + Condition = {
                          + ArnNotLike      = {
                              + "aws:PrincipalArn" = "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*/AWSReservedSSO_AdministratorAccess_*"
                            }
                          + StringNotEquals = {
                              + "aws:RequestedRegion" = [
                                  + "us-east-1",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                      + Sid       = "DenyBedrockCrossRegionExceptAdmin"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id          = "p-bqqwq31q"
        name        = "RegionRestriction"
        tags        = {}
        # (4 unchanged attributes hidden)
    }

  # aws_organizations_policy.security_defaults will be created
  + resource "aws_organizations_policy" "security_defaults" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DisableEbsEncryptionByDefault",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenyDisableEBSEncryption"
                    },
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + StringNotEquals = {
                              + "ec2:MetadataHttpTokens" = "required"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:ec2:*:*:instance/*"
                      + Sid       = "DenyIMDSv1"
                    },
                  + {
                      + Action   = [
                          + "s3:PutAccountPublicAccessBlock",
                          + "s3:DeleteAccountPublicAccessBlock",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenyRemoveS3PublicAccessBlock"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Enforce EBS encryption, IMDSv2, and S3 public access block"
      + id          = (known after apply)
      + name        = "SecurityDefaults"
      + tags_all    = {
          + "Layer"      = "governance"
          + "ManagedBy"  = "Terraform"
          + "Repository" = "aws-organization-governance"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.security_defaults_dev will be created
  + resource "aws_organizations_policy_attachment" "security_defaults_dev" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-srmc-f52jl8so"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + security_defaults_scp_arn  = (known after apply)
  + security_defaults_scp_id   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Workflow: `Terraform PR Checks` | Run: [23699195114](https://github.com/gamaware/aws-organization-governance/actions/runs/23699195114)*